Revit 2027 API
ExternalResourceBrowserData.IsValidResourceName Method
 Checks whether the resource name is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidResourceName(
	string resourceName
)
Public Function IsValidResourceName (
	resourceName As String
) As Boolean
public:
bool IsValidResourceName(
	String^ resourceName
)
member IsValidResourceName :
        resourceName : string -> bool
Parameters
resourceName String
 The resource name to check.
Return Value
Boolean
 True if the name is a valid resource name, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace